junqiangwu/STM32_Projects/STM32_FOC_Bldc_No Hall/BLDC PMSM2 - 1/BLDC PMSM2/src/stm32f10x_svpwm_1shunt.c
/*******************************************************************************
* Function Name  : SVPWM_1ShuntGetPhaseCurrentValues
* Description    : This function computes current values of Phase A and Phase B 
*                 in q1.15 format starting from values acquired from the A/D 
*                 Converter peripheral.
* Input          : None
* Output         : Stat_Curr_a_b
* Return         : None
*******************************************************************************/
Curr_Components SVPWM_1ShuntGetPhaseCurrentValues(void)
{
    Curr_Components Local_Stator_Currents;
    s32 wAux;
    s16 hCurrA = 0, hCurrB = 0, hCurrC = 0;
    u8 bCurrASamp = 0, bCurrBSamp = 0, bCurrCSamp = 0;

    
    if (csCurrentSampled.sampCur1 == SAMP_OLDA)
    {
      hCurrA = hCurrAOld;
      bCurrASamp = 1;
    }
    
    if (csCurrentSampled.sampCur1 == SAMP_OLDB)
    {
      hCurrB = hCurrBOld;
      bCurrBSamp = 1;
    }
    
    // First sampling point
    wAux =  (s32)(ADC1->JDR2 << 1) - (s32)(hPhaseOffset);
    
    switch (csCurrentSampled.sampCur1)
    {
    case SAMP_IA:
    case SAMP_IB:
    case SAMP_IC:
            break;
    case SAMP_NIA:
    case SAMP_NIB:
    case SAMP_NIC:
            wAux = -wAux; 
            break;
    default:
            wAux = 0;
    }
    
    // Check saturation
    if (wAux < S16_MIN)
    {
            wAux = S16_MIN;
    }  
    else  if (wAux > S16_MAX)
    { 
            wAux = S16_MAX;
    }
    else
    {
            wAux = (s16)(wAux);
    }
    
    switch (csCurrentSampled.sampCur1)
    {
    case SAMP_IA:
    case SAMP_NIA:
            hCurrA = (s16)(wAux);
            bCurrASamp = 1;
            break;
    case SAMP_IB:
    case SAMP_NIB:
            hCurrB = (s16)(wAux);
            bCurrBSamp = 1;
            break;
    case SAMP_IC:
    case SAMP_NIC:
            hCurrC = (s16)(wAux);
            bCurrCSamp = 1;
            break;
    }
    
    // Second sampling point
    wAux = (s32)(ADC1->JDR1 << 1) - (s32)(hPhaseOffset);
    
    switch (csCurrentSampled.sampCur2)
    {
    case SAMP_IA:
    case SAMP_IB:
    case SAMP_IC:
            break;
    case SAMP_NIA:
    case SAMP_NIB:
    case SAMP_NIC:
            wAux = -wAux; 
            break;
    default:
            wAux = 0;
    }
    
    // Check saturation
    if (wAux < S16_MIN)
    {
            wAux = S16_MIN;
    }  
    else  if (wAux > S16_MAX)
    { 
            wAux = S16_MAX;
    }
    else
    {
            wAux = (s16)(wAux);
    }
    
    switch (csCurrentSampled.sampCur2)
    {
    case SAMP_IA:
    case SAMP_NIA:
            hCurrA = (s16)(wAux);
            bCurrASamp = 1;
            break;
    case SAMP_IB:
    case SAMP_NIB:
            hCurrB = (s16)(wAux);
            bCurrBSamp = 1;
            break;
    case SAMP_IC:
    case SAMP_NIC:
            hCurrC = (s16)(wAux);
            bCurrCSamp = 1;
            break;
    }
    
    // Computation of the third value
    if (bCurrASamp == 0)
            hCurrA = -hCurrB -hCurrC;
    if (bCurrBSamp == 0)
            hCurrB = -hCurrA -hCurrC;
    if (bCurrCSamp == 0)
            hCurrC = -hCurrA -hCurrB;
    
    // hCurrA, hCurrB, hCurrC values are the sampled values
    
	#ifdef CURRENT_COMPENSATION
	    if (bReadDelta == 1)  
	    {
	      hDeltaA = hCurrAOld - hCurrA;
	      hDeltaB = hCurrBOld - hCurrB;
	      hDeltaC = hCurrCOld - hCurrC;
	    }
      
	    if (bStatorFluxPos == BOUNDARY_2)
	    {
	      hCurrA += hDeltaA;
	      hCurrB += hDeltaB;
	      hCurrC += hDeltaC;
	    }
	#endif
    
    hCurrAOld = hCurrA;
    hCurrBOld = hCurrB;
    hCurrCOld = hCurrC;

    Local_Stator_Currents.qI_Component1 = hCurrA;
    Local_Stator_Currents.qI_Component2 = hCurrB;
    
    return(Local_Stator_Currents); 
}

/*******************************************************************************
* Function Name  : SVPWM_1ShuntAdvCurrentReading
* Description    :  It is used to enable or disable the current reading.
* Input          : cmd (ENABLE or DISABLE)
* Output         : None
* Return         : None
*******************************************************************************/
void SVPWM_1ShuntAdvCurrentReading(FunctionalState cmd)
{
  if (cmd == ENABLE)
  {
    // Enable UPDATE ISR
    // Clear Update Flag
    TIM_ClearFlag(TIM1, TIM_FLAG_Update);
    TIM_ITConfig(TIM1, TIM_IT_Update, ENABLE);
    
    // Distortion for single shunt enabling
    bDistEnab = 1;
  }
  else
  {
    // Disable UPDATE ISR
    TIM_ITConfig(TIM1, TIM_IT_Update, DISABLE);

    // Sync ADC trigger with Update
    ADC_ExternalTrigInjectedConvConfig(ADC1, ADC_ExternalTrigInjecConv_T1_TRGO);

	// Enabling the Injectec conversion for ADC1
  	ADC_ExternalTrigInjectedConvCmd(ADC1,ENABLE);
    
    // Clear pending bit and Enable the EOC ISR
    ADC_ClearFlag(ADC1, ADC_FLAG_JEOC);
    ADC_ITConfig(ADC1, ADC_IT_JEOC, ENABLE);
    
    // Distortion for single shunt disabling
    bDistEnab = 0;
    
    // Disabling the last setting of PWM Mode and Duty Register
    hPreloadCCMR1Set = hPreloadCCMR1Disable | CH1NORMAL | CH2NORMAL;
    hPreloadCCMR2Set = hPreloadCCMR2Disable | CH3NORMAL | CH4NORMAL;
    TIM1->CCMR1 = hPreloadCCMR1Set; // Switch to Normal 
    TIM1->CCMR2 = hPreloadCCMR2Set; // Switch to Normal
    
    // Disabling all DMA previous setting
    TIM_DMACmd(TIM1, TIM_DMA_CC1, DISABLE);
    TIM_DMACmd(TIM1, TIM_DMA_CC2, DISABLE);
    TIM_DMACmd(TIM1, TIM_DMA_CC3, DISABLE);
    
    // Set all duty to 50%
    TIM1->CCR1 = PWM_PERIOD >> 1;
    TIM1->CCR2 = PWM_PERIOD >> 1;
    TIM1->CCR3 = PWM_PERIOD >> 1;    
  }
}

/*******************************************************************************
* Function Name  : SVPWMEOCEvent
* Description    :  Routine to be performed inside the end of conversion ISR
			store the first sampled value and compute the bus voltage and temperature
			sensor sampling  and disable the ext. adc triggering.
* Input           : None
* Output         : Return false after first EOC, return true after second EOC
* Return         : None
*******************************************************************************/
u8 SVPWMEOCEvent(void)
{
  //if (bDistEnab == 1)
 // {
    // Diabling the Injectec conversion for ADC1
 //   ADC_ExternalTrigInjectedConvCmd(ADC1,DISABLE);
 // }
  
