junqiangwu/STM32_Projects/STM32_FOC_Bldc_No Hall/BLDC PMSM2 - 1/BLDC PMSM2/src/stm32f10x_svpwm_1shunt.c
  // Store the Bus Voltage and temperature sampled values
  //h_ADCTemp = ADC_GetInjectedConversionValue(ADC2,ADC_InjectedChannel_1);
 // h_ADCBusvolt = ADC_GetInjectedConversionValue(ADC2,ADC_InjectedChannel_2);
  
  return ((u8)(1));
}

/*******************************************************************************
* Function Name  : SVPWMUpdateEvent
* Description    :  Routine to be performed inside the update event ISR. 
                    It is used to set the PWM output mode of the four channels 
                    (Toggle or PWM), enable or disable the DMA event for each 
                    channel, update the DMA buffers, update the DMA lenght and 
                    finally it re-enables the external ADC triggering.	
* Input           : None
* Output         : None
* Return         : None
*******************************************************************************/
void SVPWMUpdateEvent(void)
{
  if (bInverted_pwm_new != bInverted_pwm)  
  {
    // Critical point start
    
    // Update CCMR (OC Mode)
    TIM1->CCMR1 = hPreloadCCMR1Disable; // Switch to Frozen
    TIM1->CCMR1 = hPreloadCCMR1Set; // Switch to Normal or Toggle
    
    TIM1->CCMR2 = hPreloadCCMR2Disable; // Switch to Frozen
    TIM1->CCMR2 = hPreloadCCMR2Set; // Switch to Normal or Toggle
    
    // Disable DMA (in this period is not inverted)
    switch (bInverted_pwm)
    {
    case INVERT_A:
      //TIM1_DMACmd(TIM1_DMA_CC1, DISABLE);
      TIM1->DIER &= ~TIM_DMA_CC1;
      DMA1_Channel2->CCR &= CCR_ENABLE_Reset;
      TIM1->CCR1 = hCCRBuff[0];
      break;
    case INVERT_B:
      //TIM1_DMACmd(TIM1_DMA_CC2, DISABLE);
      TIM1->DIER &= ~TIM_DMA_CC2;
      DMA1_Channel3->CCR &= CCR_ENABLE_Reset;
      TIM1->CCR2 = hCCRBuff[1];
      break;
    case INVERT_C:
      //TIM1_DMACmd(TIM1_DMA_CC3, DISABLE);
      TIM1->DIER &= ~TIM_DMA_CC3;
      DMA1_Channel6->CCR &= CCR_ENABLE_Reset;
      TIM1->CCR3 = hCCRBuff[2];
      break;
    default:
      break;
    }
    
    // Enable DMA (in this period channel is toggled)
    switch (bInverted_pwm_new)
    {
    case INVERT_A:
      DMA1_Channel2->CCR &= CCR_ENABLE_Reset;
      DMA1_Channel2->CNDTR = 4;
      DMA1_Channel2->CCR |= CCR_ENABLE_Set;
      
      //TIM1_DMACmd(TIM1_DMA_CC1, ENABLE); 
      TIM1->DIER |= TIM_DMA_CC1;  
      
      if (bInverted_pwm_new == INVERT_A)
      {
        if (hCCRBuff[0] <= MINTIMCNTUPHAND)
        {
          TIM1->CCMR1 = TIM1->CCMR1 & 0xFF8F; // Switch to Frozen Ch1
          TIM1->CCMR1 = TIM1->CCMR1 | 0x0040; // Force Low Ch1
          TIM1->CCMR1 = TIM1->CCMR1 & 0xFF8F; // Switch to Frozen Ch1
          TIM1->CCMR1 = TIM1->CCMR1 | 0x0030; // Switch to Toggle Ch1
          
          //TIM1_GenerateEvent(TIM1_EventSource_CC1);
          TIM1->EGR |= TIM_EventSource_CC1;
        }
      }
      break;
      
    case INVERT_B:
      DMA1_Channel3->CCR &= CCR_ENABLE_Reset;
      DMA1_Channel3->CNDTR = 4;
      DMA1_Channel3->CCR |= CCR_ENABLE_Set;
      
      //TIM1_DMACmd(TIM1_DMA_CC2, ENABLE); 
      TIM1->DIER |= TIM_DMA_CC2;
      
      if (bInverted_pwm_new == INVERT_B)
      {
        if (hCCRBuff[1] <= MINTIMCNTUPHAND)
        {
          TIM1->CCMR1 = TIM1->CCMR1 & 0x8FFF; // Switch to Frozen Ch2
          TIM1->CCMR1 = TIM1->CCMR1 | 0x4000; // Force Low Ch2
          TIM1->CCMR1 = TIM1->CCMR1 & 0x8FFF; // Switch to Frozen Ch2
          TIM1->CCMR1 = TIM1->CCMR1 | 0x3000; // Switch to Toggle Ch2
          
          //TIM1_GenerateEvent(TIM1_EventSource_CC2);
          TIM1->EGR |= TIM_EventSource_CC2;
        }
      }
      break;
      
    case INVERT_C:
      DMA1_Channel6->CCR &= CCR_ENABLE_Reset;
      DMA1_Channel6->CNDTR = 4;
      DMA1_Channel6->CCR |= CCR_ENABLE_Set;
      
      //TIM1_DMACmd(TIM1_DMA_CC3, ENABLE);
      TIM1->DIER |= TIM_DMA_CC3;
      
      if (bInverted_pwm_new == INVERT_C)
      {
        if (hCCRBuff[2] <= MINTIMCNTUPHAND)
        {
          TIM1->CCMR2 = TIM1->CCMR2 & 0xFF8F; // Switch to Frozen Ch3
          TIM1->CCMR2 = TIM1->CCMR2 | 0x0040; // Force Low Ch3
          TIM1->CCMR2 = TIM1->CCMR2 & 0xFF8F; // Switch to Frozen Ch3
          TIM1->CCMR2 = TIM1->CCMR2 | 0x0030; // Switch to Toggle Ch3
          
          //TIM1_GenerateEvent(TIM1_EventSource_CC3);
          TIM1->EGR |= TIM_EventSource_CC3;
        }
      }
      break;
      
    default:
      break;
    }
    
    // Critical point stop
    
    // Adjust the DMA lenght for Ch4
    //DMA_Cmd(DMA_Channel4, DISABLE);
    DMA1_Channel4->CCR &= CCR_ENABLE_Reset;
    if (bInverted_pwm_new == INVERT_NONE)
    { 
      // Length 2
      DMA1_Channel4->CNDTR = 2;
    }
    else
    {
      // Length 4
      DMA1_Channel4->CNDTR = 4;
    }
    //DMA_Cmd(DMA_Channel4, ENABLE);
    DMA1_Channel4->CCR |= CCR_ENABLE_Set;
  }
  
  switch (bInverted_pwm_new)
  {
  case INVERT_A: 
    if (hCCRBuff[0] <= DMABURSTMIN_A)
    {
      // Reset the status
      TIM1->CCMR1 = TIM1->CCMR1 & 0xFF8F; // Switch to Frozen Ch1
      TIM1->CCMR1 = TIM1->CCMR1 | 0x0040; // Force Low Ch1
      TIM1->CCMR1 = TIM1->CCMR1 & 0xFF8F; // Switch to Frozen Ch1
      TIM1->CCMR1 = TIM1->CCMR1 | 0x0030; // Switch to Toggle Ch1
      
      //TIM1_DMACmd(TIM1_DMA_CC1, ENABLE); 
      TIM1->DIER |= TIM_DMA_CC1;
      DMA1_Channel2->CCR &= CCR_ENABLE_Reset;
      DMA1_Channel2->CNDTR = 4;
      DMA1_Channel2->CCR |= CCR_ENABLE_Set;

      TIM_GenerateEvent(TIM1, TIM_EventSource_CC1);
      
      if (dvDutyValues.hTimePhA < DMABURSTMIN_A)
        dvDutyValues.hTimePhA = DMABURSTMIN_A;
    }
    break;  
      
  case INVERT_B:
    if (hCCRBuff[1] <= DMABURSTMIN_B)
    {
      // Reset the status
      TIM1->CCMR1 = TIM1->CCMR1 & 0x8FFF; // Switch to Frozen Ch2
      TIM1->CCMR1 = TIM1->CCMR1 | 0x4000; // Force Low Ch2
      TIM1->CCMR1 = TIM1->CCMR1 & 0x8FFF; // Switch to Frozen Ch2
      TIM1->CCMR1 = TIM1->CCMR1 | 0x3000; // Switch to Toggle Ch2
      
      //TIM1_DMACmd(TIM1_DMA_CC2, ENABLE); 
      TIM1->DIER |= TIM_DMA_CC2;
      DMA1_Channel3->CCR &= CCR_ENABLE_Reset;
      DMA1_Channel3->CNDTR = 4;
      DMA1_Channel3->CCR |= CCR_ENABLE_Set;

      TIM_GenerateEvent(TIM1, TIM_EventSource_CC2);
      
